/*
Завдання 1(task1.js):
Створіть програму для обчислення податку на дохід за наступними умовами залежно 
від рівня базового доходу, вказаного у змінній:

Якщо дохід менше 10 000, податок складає 5% від доходу.
Якщо дохід від 10 000 до 50 000 (включно), податок складає 10% від доходу.
Якщо дохід від 50 001 до 100 000 (включно), податок складає 15% від доходу.
Якщо дохід від 100 001 до 200 000 (включно), податок складає 20% від доходу.
Якщо дохід більше 200 000, податок складає 25% від доходу.
Вивести в консоль: базовий дохід, відсоток податку, дохід після вирахування податків.
*/
let incomeTax = 0    //податок на дохід
let income = 200001 //дохід

if (income < 10000) {
    incomeTax = 5
} else if (income >= 10000 && income <= 50000) {
    incomeTax = 10
} else if (income >= 50001 && income <= 100000) {
    incomeTax = 15
} else if (income >= 100001 && income <= 200000) {
    incomeTax = 20
} else incomeTax = 25

let netProfit = income
netProfit *= (1 - incomeTax/100) //чистий дохід

console.log(`базовий дохід : ${income}, відсоток податку : ${incomeTax} %, дохід після вирахування податків : ${netProfit.toFixed(2)}.`)



